
[X2Ability_WOTC_APA_SpecialistAbilitySet]

;  -- Localized Strings for Tech. Specialist Abilities --
;  ------------------------------------------------------

strProtocolPackages1Name = "协议包 I"
strProtocolPackages1Desc = "<font color='#CA7200'>职业技能熟练度I段</font><br/><Bullet/>获得基础[援/盲/战]协议能力:<br/>   - 援助协议<br/>   - 致盲协议<br/>   - 战争协议<br/><Bullet/>所有初充能耗尽后，[援/盲/战]协议将缓慢再充能。"

strProtocolPackages2Name = "协议包 II"
strProtocolPackages2Desc = "<font color='#CA7200'>职业技能熟练度II段</font><br/><Bullet/>获得基础[援/盲/战]协议能力。<br/><Bullet/>获得失控协议能力。<br/><Bullet/>获得修复协议能力。<br/><Bullet/>小精灵协议能力不再消耗所有剩余行动点。"

strProtocolPackages3Name = "协议包 III"
strProtocolPackages3Desc = "<font color='#CA7200'>职业技能熟练度III段</font><br/><Bullet/>获得基础[援/盲/战]协议能力。<br/><Bullet/>获得失控协议能力。<br/><Bullet/>获得修复协议能力。<br/><Bullet/>小精灵协议能力不再消耗所有剩余行动点。<br/><Bullet/>[援/盲/战]协议增加<font color='#3ABD23'>+<Ability:PP_III_ABC_PROTOCOL_CHARGE_BONUS/></font>初充能次数，减少<font color='#3ABD23'><Ability:PP_III_ABC_PROTOCOL_RECHARGE_BONUS/></font>再充能回合。"


strProtocolSquadConcealmentBrokenFlyover = "小队隐蔽已移除！"

strAidProtocolDefenseEffectName = "援助协议""
strAidProtocolDefenseEffectDesc = "+防御"

strNeutralizingAgentsEffectName = "中和剂: 免疫力"
strNeutralizingAgentsEffectDesc = "援助协议烟雾里的中和剂可移除活性效果，提供对酸性、燃烧、毒素的免疫力。"

[X2Effect_WOTC_APA_Failsafe]
strFailsafeTriggeredFlyover = "骇入保险: 负面效果已失效"

[X2Effect_WOTC_APA_DisruptionField]
strDisruptionFieldFlyover = "干扰立场: 保证失误！"

[X2Effect_WOTC_APA_RemoteRepair]
strRepairedMessage="+<HealMod/>损坏修复"

[X2Effect_WOTC_APA_ApplyAidProtocolSmokeToWorld]
strEffectName="援助协议: 防御烟雾"
strEffectDesc="当在中和剂烟雾里，该单位将对酸性、燃烧、毒素伤害免疫。"

[X2Effect_WOTC_APA_ApplyNeutralizingAgentsSmokeToWorld]
strEffectName="中和剂: 伤害免疫"
strEffectDesc="当在中和剂烟雾里，该单位将对酸性、燃烧、毒素伤害免疫。"

[X2Effect_WOTC_APA_AdvancedArmorRepair]
strAdvancedArmorRepairMsg="护甲修复: +<HealMod/>护甲恢复"

[X2Effect_WOTC_APA_ReduceActionsAfterHack]
strReduceActionsAfterHackFlyover = "电子战: 有限行动!"

[X2Effect_WOTC_APA_ExtendedShutdownTurns]
strExtendedShutdownTurnsFlyover = "电子战:  关机持续时间已延长！"

[X2Effect_WOTC_APA_SetProtocolRechargeCooldown]
strProtocolRechargeFlyover = "...协议再充能中"